/*	стандартные заголовочные файлы		*/
#include <math.h>
#include "constant.h"
/*	пользовательские заголовочные файлы	*/
#include "_math_.h"

//-----------------------------------------------------------------------
/*						‘ункци€ округлени€ числа	
	возвращает наименьшее число, если число положительное,
    наибольшее число, если число отрицательное
    Ќапример: Int(12.8)=12;
              Int(-2.8)=-2;                                            */
//---------------------------------------------------------------------
double Int(double number)
{
    if (number>0) return floor(number);
    else return ceil(number);
}
//-----------------------------------------------------------------------
/*	‘ункци€ вычислени€ тангенса угла y/x, возвращает тангенс угла 	
	возвращает значение арктангенса отношени€ у/х					   */
//-----------------------------------------------------------------------
double tan2(double y,double x)
{
  double out=0;

  if (x > 0)              { out= atan(y/x);}
  
  if ((x < 0) && (y >= 0)) { out= atan(y/x)+_PI_;}
  
  if ((x==0) && (y>0)) { out= _PI_/2;}
  
  if ((x<0) && (y<0)) { out= atan(y/x)-_PI_;}  
  
  if ((x==0) && (y>0)) { out= -_PI_/2;}
  
  if ((x==0) && (y==0)) 
  {
    out= 0;
   }  
  
  return out;
}

//-----------------------------------------------------------------------
/* ‘ункци€ возвращает остаток от делени€ х на у в диапазоне от 0<=mod<x
  Ќапример: mod(2.3,2.)=0.3 
			mod(-2.3,2.)=1.7											*/
//------------------------------------------------------------------------
double mod(double x, double y)
{
  return x-y*floor(x/y);
} 

//-------------------------------------------------------------------------
/*	‘ункци€ проверки числа на знак
	¬озращает 1, если число положительное;
			  -1, если число отрицательное;
			   0, если 0  
*/
//----------------------------------------------------------------------
int Sign(double val)
{
    if (val<0.0) return -1;
    if (val>0.0) return 1;
    if (val==0.0) return 0;
     return -2;
}
//-------------------------------------------------------------------------
